Repository: kumarmantu511/vid_viz
Catalog: lib/l10n/app_*.arb
Languages: hi

# settingsTitle
source: Settings
hi: सेटिंग्स

# appearanceSectionTitle
source: Appearance
hi: दिखावट

# themeLabel
source: Theme
hi: थीम

# themeSubtitleSystem
source: System default
hi: सिस्टम डिफ़ॉल्ट

# themeOptionSystem
source: System
hi: सिस्टम

# themeOptionLight
source: Light
hi: लाइट (हल्का)

# themeOptionDark
source: Dark
hi: डार्क (गहरा)

# languageLabel
source: Language
hi: भाषा

# languageSubtitle
source: Select application language
hi: एप्लिकेशन की भाषा चुनें

# languageOptionEnglish
source: English
hi: अंग्रेज़ी

# languageOptionTurkish
source: Turkish
hi: तुर्की

# languageOptionSpanish
source: Spanish
hi: स्पेनिश

# languageOptionPortuguese
source: Portuguese
hi: पुर्तगाली

# languageOptionHindi
source: Hindi
hi: हिंदी

# languageOptionChinese
source: Chinese
hi: चीनी

# languageOptionArabic
source: Arabic
hi: अरबी

# languageOptionFrench
source: French
hi: फ्रेंच

# languageOptionGerman
source: German
hi: जर्मन

# languageOptionRussian
source: Russian
hi: रूसी

# languageOptionJapanese
source: Japanese
hi: जापानी

# languageOptionKorean
source: Korean
hi: कोरियाई

# performanceSectionTitle
source: Performance & Cache
hi: प्रदर्शन और कैश

# clearVisualizerCacheTitle
source: Clear visualizer cache
hi: विज़ुअलाइज़र कैश साफ़ करें

# clearVisualizerCacheSubtitle
source: Discard precomputed FFT data
hi: पहले से गणना किए गए FFT डेटा को हटाएं

# clearVisualizerCacheSnack
source: Visualizer cache cleared
hi: विज़ुअलाइज़र कैश साफ़ कर दिया गया

# clearAudioReactiveCacheTitle
source: Clear audio reactive cache
hi: ऑडियो रिएक्टिव कैश साफ़ करें

# clearAudioReactiveCacheSubtitle
source: Discard cached FFT data
hi: कैश किए गए FFT डेटा को हटाएं

# clearAudioReactiveCacheSnack
source: Audio reactive cache cleared
hi: ऑडियो रिएक्टिव कैश साफ़ कर दिया गया

# advancedSectionTitle
source: Advanced
hi: एडवांस्ड

# resetSettingsTitle
source: Reset settings to defaults
hi: सेटिंग्स को डिफ़ॉल्ट पर रीसेट करें

# resetSettingsSubtitle
source: Restore global settings
hi: ग्लोबल सेटिंग्स पुनर्स्थापित करें

# resetSettingsSnack
source: Settings reset to defaults
hi: सेटिंग्स को डिफ़ॉल्ट पर रीसेट कर दिया गया

# projectListTitle
source: My Projects
hi: मेरे प्रोजेक्ट्स

# projectListEmpty
source: No projects yet
hi: अभी तक कोई प्रोजेक्ट नहीं है

# projectListNewProject
source: New Project
hi: नया प्रोजेक्ट

# projectListContinueEditing
source: Continue Editing
hi: संपादन जारी रखें

# projectListDefaultHeadline
source: Professional Editor
hi: प्रोफेशनल एडिटर

# projectMenuDesign
source: Design
hi: डिज़ाइन

# projectMenuEditInfo
source: Edit Info
hi: जानकारी संपादित करें

# projectMenuVideos
source: Videos
hi: वीडियो

# projectMenuDelete
source: Delete
hi: हटाएं

# projectDeleteDialogTitle
source: Confirm delete
hi: हटाने की पुष्टि करें

# projectDeleteDialogMessage
source: Do you want to delete this project?
hi: क्या आप इस प्रोजेक्ट को हटाना चाहते हैं?

# commonCancel
source: Cancel
hi: रद्द करें

# commonDelete
source: Delete
hi: हटाएं

# commonOk
source: OK
hi: ठीक है

# projectEditAppBarNew
source: New Project
hi: नया प्रोजेक्ट

# projectEditAppBarEdit
source: Edit Project
hi: प्रोजेक्ट संपादित करें

# projectEditTitleHint
source: Enter project title
hi: प्रोजेक्ट का शीर्षक दर्ज करें

# projectEditTitleValidation
source: Please enter a title
hi: कृपया एक शीर्षक दर्ज करें

# projectEditDescriptionHint
source: Add description (optional)
hi: विवरण जोड़ें (वैकल्पिक)

# projectEditCreateButton
source: Create Project
hi: प्रोजेक्ट बनाएं

# projectEditSaveButton
source: Save Changes
hi: बदलाव सहेजें

# directorMissingAssetsTitle
source: Some assets have been deleted
hi: कुछ एसेट्स हटा दिए गए हैं

# directorMissingAssetsMessage
source: To continue you must recover deleted assets on your device or remove them from the timeline (marked in red).
hi: जारी रखने के लिए आपको अपने डिवाइस पर हटाए गए एसेट्स को पुनर्प्राप्त करना होगा या उन्हें टाइमलाइन से हटाना होगा (लाल रंग में चिह्नित)।

# editorHeaderCloseTooltip
source: Close
hi: बंद करें

# editorHeaderArchiveTooltip
source: Import/Export Project (.vvz)
hi: प्रोजेक्ट इम्पोर्ट/एक्सपोर्ट (.vvz)

# editorHeaderViewGeneratedTooltip
source: View Generated Videos
hi: जनरेट किए गए वीडियो देखें

# editorHeaderExportTooltip
source: Export Video
hi: वीडियो एक्सपोर्ट करें

# editorHeaderAddVideoFirstTooltip
source: Add video first
hi: पहले वीडियो जोड़ें

# editorGenerateTooltip
source: Generate video
hi: वीडियो जनरेट करें

# editorGenerateFullHdLabel
source: Generate Full HD 1080px
hi: Full HD 1080px जनरेट करें

# editorGenerateHdLabel
source: Generate HD 720px
hi: HD 720px जनरेट करें

# editorGenerateSdLabel
source: Generate SD 360px
hi: SD 360px जनरेट करें

# exportSheetTitle
source: Export Video
hi: वीडियो एक्सपोर्ट करें

# exportSheetResolutionLabel
source: Resolution
hi: रिज़ॉल्यूशन

# exportSheetResolutionHelp
source: Higher Resolution: Crystal Clear Playback for large screen
hi: उच्च रिज़ॉल्यूशन: बड़ी स्क्रीन के लिए एकदम स्पष्ट प्लेबैक

# exportSheetFileFormatLabel
source: File Format
hi: फ़ाइल प्रारूप

# exportSheetFpsLabel
source: Frames Per Second
hi: फ्रेम प्रति सेकंड (FPS)

# exportSheetFpsHelp
source: Higher frame rate makes smoother animation
hi: उच्च फ्रेम दर एनीमेशन को अधिक स्मूथ बनाती है

# exportSheetQualityLabel
source: Quality / Bitrate
hi: गुणवत्ता / बिटरेट

# exportSheetQualityLow
source: Low
hi: निम्न

# exportSheetQualityMedium
source: Medium
hi: मध्यम

# exportSheetQualityHigh
source: High
hi: उच्च

# exportSheetButtonExport
source: Export Video
hi: वीडियो एक्सपोर्ट करें

# videoQualityUltra
source: Ultra Quality
hi: अल्ट्रा क्वालिटी

# videoQualityStandard
source: Standard Quality
hi: मानक क्वालिटी

# exportLegacyViewVideos
source: View Videos
hi: वीडियो देखें

# exportProgressPreprocessingTitle
source: Preprocessing files
hi: फ़ाइलों की प्री-प्रोसेसिंग

# exportProgressBuildingTitle
source: Building your video
hi: आपका वीडियो बनाया जा रहा है

# exportProgressSavedTitle
source: Your video has been saved in the gallery
hi: आपका वीडियो गैलरी में सहेज लिया गया है

# exportProgressErrorTitle
source: Error
hi: त्रुटि

# exportProgressErrorMessage
source: An unexpected error occurred. We will work on it. Please try again or upgrade to new versions of the app if the error persists.
hi: एक अप्रत्याशित त्रुटि हुई। हम इस पर काम करेंगे। कृपया पुनः प्रयास करें या यदि त्रुटि बनी रहती है तो ऐप को नए संस्करण में अपडेट करें।

# exportProgressFileOfTotal
source: File {current} of {total}
hi: फ़ाइल {total} में से {current}

# exportProgressRemaining
source: {minutes} min {seconds} secs remaining
hi: {minutes} मिनट {seconds} सेकंड शेष

# exportProgressCancelButton
source: CANCEL
hi: रद्द करें

# exportProgressOpenVideoButton
source: OPEN VIDEO
hi: वीडियो खोलें

# exportVideoListFallbackTitle
source: Generated Videos
hi: जनरेट किए गए वीडियो

# exportVideoListHeaderTitle
source: Exported Videos
hi: एक्सपोर्ट किए गए वीडियो

# exportVideoListEmptyTitle
source: No exported videos yet
hi: अभी तक कोई एक्सपोर्ट किया गया वीडियो नहीं

# exportVideoListEmptySubtitle
source: Your exported videos will appear here
hi: आपके एक्सपोर्ट किए गए वीडियो यहां दिखाई देंगे

# exportVideoListFileNotFoundTitle
source: File Not Found
hi: फ़ाइल नहीं मिली

# exportVideoListFileNotFoundMessage
source: This video file has been deleted from your device.
hi: यह वीडियो फ़ाइल आपके डिवाइस से हटा दी गई है।

# exportVideoListDeleteDialogTitle
source: Delete Video?
hi: वीडियो हटाएं?

# exportVideoListDeleteDialogMessage
source: This action cannot be undone.
hi: इस क्रिया को पूर्ववत नहीं किया जा सकता।

# exportVideoListViewGeneratedTooltip
source: View generated videos
hi: जनरेट किए गए वीडियो देखें

# exportVideoListCount
source: {count, plural, =0{0 videos} =1{1 video} other{{count} videos}}
hi: {count, plural, =0{0 वीडियो} =1{1 वीडियो} other{{count} वीडियो}}

# audioMixerTitle
source: Audio Mixer
hi: ऑडियो मिक्सर

# audioMixerAudioOnlyPlay
source: Audio-only play
hi: केवल-ऑडियो प्लेबैक

# audioMixerUseOriginalVideoAudio
source: Use original video audio
hi: मूल वीडियो ऑडियो का उपयोग करें

# audioMixerNoAudioLayers
source: No audio layers found
hi: कोई ऑडियो लेयर नहीं मिली

# audioMixerMuted
source: Muted
hi: म्यूट किया गया

# audioMixerVolumeSuffix
source: Volume
hi: वॉल्यूम

# audioReactivePresetsTitle
source: Presets
hi: प्रीसेट्स

# audioReactivePresetUltraSubtle
source: Ultra Subtle
hi: अल्ट्रा सटल (बहुत सूक्ष्म)

# audioReactivePresetSubtle
source: Subtle
hi: सटल (सूक्ष्म)

# audioReactivePresetSoft
source: Soft
hi: सॉफ्ट (कोमल)

# audioReactivePresetNormal
source: Normal
hi: नॉर्मल (सामान्य)

# audioReactivePresetGroove
source: Groove
hi: ग्रूव

# audioReactivePresetPunchy
source: Punchy
hi: पंचदार

# audioReactivePresetHard
source: Hard
hi: हार्ड (कठोर)

# audioReactivePresetExtreme
source: Extreme
hi: एक्सट्रीम (चरम)

# audioReactivePresetInsane
source: Insane
hi: इन्सेन (पागलपन)

# audioReactivePresetChill
source: Chill
hi: चिल (शांत)

# audioReactiveSidebarTooltip
source: Audio Reactive
hi: ऑडियो रिएक्टिव

# audioReactiveTargetOverlayLabel
source: Target Overlay
hi: लक्ष्य ओवरले

# audioReactiveNoOverlays
source: No overlays available
hi: कोई ओवरले उपलब्ध नहीं

# audioReactiveOverlayTypeMedia
source: Media
hi: मीडिया

# audioReactiveOverlayTypeAudioReactive
source: Audio Reactive
hi: ऑडियो रिएक्टिव

# audioReactiveOverlayTypeText
source: Text
hi: टेक्स्ट

# audioReactiveOverlayTypeVisualizer
source: Visualizer
hi: विज़ुअलाइज़र

# audioReactiveOverlayTypeShader
source: Shader
hi: शेडर (Shader)

# audioReactiveOverlayTypeUnknown
source: Unknown
hi: अज्ञात

# audioReactiveOverlayUnnamed
source: Unnamed
hi: बिना नाम का

# audioReactiveAudioSourceLabel
source: Audio Source
hi: ऑडियो स्रोत

# audioReactiveAudioSourceMixed
source: All Audio (Mixed)
hi: सभी ऑडियो (मिश्रित)

# audioReactiveAudioSourceUnnamed
source: Unnamed Audio
hi: बिना नाम का ऑडियो

# audioReactiveNoDedicatedTracks
source: No dedicated audio tracks found. Using global mix.
hi: कोई समर्पित ऑडियो ट्रैक नहीं मिला। ग्लोबल मिक्स का उपयोग किया जा रहा है।

# audioReactiveReactiveTypeLabel
source: Reactive Type:
hi: रिएक्टिव प्रकार:

# audioReactiveReactiveTypeScale
source: Scale (Grow/Shrink)
hi: स्केल (बढ़ना/सिकुड़ना)

# audioReactiveReactiveTypeRotation
source: Rotation (Rotate)
hi: रोटेशन (घूमना)

# audioReactiveReactiveTypeOpacity
source: Opacity (Transparency)
hi: ओपेसिटी (पारदर्शिता)

# audioReactiveReactiveTypePosX
source: Position X (Horizontal)
hi: स्थिति X (क्षैतिज)

# audioReactiveReactiveTypePosY
source: Position Y (Vertical)
hi: स्थिति Y (लंबवत)

# audioReactiveReactiveTypeFallback
source: Scale
hi: स्केल

# audioReactiveSensitivityLabel
source: Sensitivity
hi: संवेदनशीलता

# audioReactiveFrequencyRangeLabel
source: Frequency Range
hi: फ्रीक्वेंसी रेंज

# audioReactiveFrequencyAll
source: ALL
hi: सभी

# audioReactiveFrequencyBass
source: BASS
hi: बास (Bass)

# audioReactiveFrequencyMid
source: MID
hi: मिड (Mid)

# audioReactiveFrequencyTreble
source: TREBLE
hi: ट्रेबल (Treble)

# audioReactiveSmoothingLabel
source: Smoothing
hi: स्मूथिंग

# audioReactiveDelayLabel
source: Delay
hi: विलंब (Delay)

# audioReactiveMinLabel
source: Min
hi: न्यूनतम

# audioReactiveMaxLabel
source: Max
hi: अधिकतम

# audioReactiveInvertLabel
source: Invert Reaction
hi: प्रतिक्रिया उलटें

# audioReactiveOn
source: ON
hi: चालू

# audioReactiveOff
source: OFF
hi: बंद

# editorFadeTitle
source: Fade In / Out
hi: फेड इन / आउट

# editorVolumeTitle
source: Asset Volume
hi: एसेट वॉल्यूम

# editorVolumeMute
source: Mute
hi: म्यूट

# editorVolumeReset
source: Reset
hi: रीसेट

# editorActionVideo
source: Video
hi: वीडियो

# editorActionImage
source: Image
hi: छवि

# editorActionAudio
source: Audio
hi: ऑडियो

# editorActionText
source: Text
hi: टेक्स्ट

# editorActionVisualizer
source: Visualizer
hi: विज़ुअलाइज़र

# editorActionShader
source: Shader
hi: शेडर

# editorActionMedia
source: Media
hi: मीडिया

# editorActionReactive
source: Reactive
hi: रिएक्टिव

# editorActionDelete
source: Delete
hi: हटाएं

# editorActionSplit
source: Split
hi: विभाजित करें

# editorActionClone
source: Clone
hi: क्लोन करें

# editorActionSettings
source: Settings
hi: सेटिंग्स

# editorActionVolume
source: Volume
hi: वॉल्यूम

# editorActionFade
source: Fade
hi: फेड

# editorActionSpeed
source: Speed
hi: गति

# editorActionReplace
source: Replace
hi: बदलें

# editorActionEdit
source: Edit
hi: संपादित करें

# colorEditorSelect
source: SELECT
hi: चुनें

# mediaPermissionRequired
source: Media permission is required!
hi: मीडिया अनुमति आवश्यक है!

# archiveHeaderTitle
source: Archive Manager
hi: आर्काइव प्रबंधक

# archiveExportSectionTitle
source: Export Project (.vvz)
hi: प्रोजेक्ट एक्सपोर्ट करें (.vvz)

# archiveTargetFolderLabel
source: Target folder
hi: लक्ष्य फ़ोल्डर

# archiveTargetFolderResolving
source: Resolving default...
hi: डिफ़ॉल्ट हल किया जा रहा है...

# archiveTargetFolderDefault
source: Downloads (auto)
hi: डाउनलोड (स्वचालित)

# archiveChooseFolder
source: Choose
hi: चुनें

# archiveResetFolder
source: Reset
hi: रीसेट

# archiveIosFolderUnsupported
source: Folder selection is not supported on iOS. Using default.
hi: iOS पर फ़ोल्डर चयन समर्थित नहीं है। डिफ़ॉल्ट का उपयोग किया जा रहा है।

# archiveStatsTotalLabel
source: Total
hi: कुल

# archiveStatsVideosLabel
source: Videos
hi: वीडियो

# archiveStatsAudiosLabel
source: Audios
hi: ऑडियो

# archiveStatsImagesLabel
source: Images
hi: छवियां

# archiveStatsMissingLabel
source: Missing
hi: गायब

# archiveIncludeVideos
source: Include videos
hi: वीडियो शामिल करें

# archiveIncludeAudios
source: Include audios
hi: ऑडियो शामिल करें

# archiveMaxVideoSizeLabel
source: Max video size (MB)
hi: अधिकतम वीडियो आकार (MB)

# archiveMaxTotalSizeLabel
source: Max total size (MB)
hi: अधिकतम कुल आकार (MB)

# archiveUnlimited
source: Unlimited
hi: असीमित

# archiveUnlimitedHint
source: 0 = Unlimited
hi: 0 = असीमित

# archiveEstimating
source: Estimating...
hi: अनुमान लगाया जा रहा है...

# archiveSizeEstimateNone
source: Size estimate: -
hi: आकार का अनुमान: -

# archiveSizeEstimate
source: Files: {files}, Size: {sizeMb} MB, Skipped: {skipped}
hi: फ़ाइलें: {files}, आकार: {sizeMb} MB, छोड़ी गई: {skipped}

# archiveSizeWarning
source: Warning: estimated size exceeds max total. Export will be blocked.
hi: चेतावनी: अनुमानित आकार अधिकतम कुल से अधिक है। एक्सपोर्ट रोक दिया जाएगा।

# archiveNoMedia
source: No media to export. Add media or relink missing files.
hi: एक्सपोर्ट करने के लिए कोई मीडिया नहीं है। मीडिया जोड़ें या गायब फ़ाइलों को फिर से लिंक करें।

# archiveExportButton
source: Export
hi: एक्सपोर्ट

# archiveImportButton
source: Import
hi: इम्पोर्ट

# archiveRelinkButton
source: Relink
hi: फिर से लिंक करें

# archiveExportedSnack
source: Exported: {path}
hi: एक्सपोर्ट किया गया: {path}

# archiveImportProjectDialogTitle
source: Import Project
hi: प्रोजेक्ट इम्पोर्ट करें

# archiveImportProjectDialogMessage
source: Current project has media. How do you want to proceed?
hi: वर्तमान प्रोजेक्ट में मीडिया है। आप कैसे आगे बढ़ना चाहते हैं?

# archiveImportProjectCreateNew
source: Create new
hi: नया बनाएं

# archiveImportProjectReplaceCurrent
source: Replace current
hi: वर्तमान को बदलें

# archiveImportCancelled
source: Import cancelled
hi: इम्पोर्ट रद्द कर दिया गया

# archiveImportFailed
source: Import failed
hi: इम्पोर्ट विफल रहा

# archiveExportPathHint
source: Export path: App Documents/exports/<Project><Timestamp>.vvz
hi: एक्सपोर्ट पथ: ऐप दस्तावेज़/exports/<Project><Timestamp>.vvz

# archivePreviewLabel
source: Preview
hi: पूर्वावलोकन

# archiveProgressPreparing
source: Preparing files
hi: फ़ाइलें तैयार की जा रही हैं

# archiveProgressPackaging
source: Packaging project
hi: प्रोजेक्ट पैकेजिंग

# archiveProgressCompressing
source: Compressing
hi: कंप्रेस किया जा रहा है

# archiveProgressExtracting
source: Extracting
hi: एक्सट्रैक्ट किया जा रहा है

# archiveProgressFinalizing
source: Finalizing
hi: अंतिम रूप दिया जा रहा है

# archiveProgressWorking
source: Working
hi: कार्यरत

# archiveProgressCompletedTitle
source: Completed
hi: पूर्ण

# archiveProgressErrorTitle
source: Error
hi: त्रुटि

# archiveProgressUnexpectedError
source: Unexpected error
hi: अप्रत्याशित त्रुटि

# archiveProgressDone
source: Done
hi: हो गया

# archiveProgressOpenFile
source: Open file
hi: फ़ाइल खोलें

# archiveProgressShare
source: Share
hi: साझा करें

# archiveProgressCancel
source: Cancel
hi: रद्द करें

# archiveProgressHide
source: Hide
hi: छिपाएं

# relinkHeaderTitle
source: Relink Missing Media
hi: गायब मीडिया को फिर से लिंक करें

# relinkSuccessSnack
source: Successfully relinked {count} item(s)
hi: {count} आइटम सफलतापूर्वक फिर से लिंक किए गए

# relinkNoMatchesSnack
source: No matching files found in selected folder. File names must match exactly.
hi: चयनित फ़ोल्डर में कोई मेल खाती फ़ाइलें नहीं मिलीं। फ़ाइल नाम बिल्कुल मेल खाना चाहिए।

# relinkErrorScanSnack
source: Error scanning folder: {error}
hi: फ़ोल्डर स्कैन करने में त्रुटि: {error}

# relinkRelinkedSnack
source: Relinked: {fileName}
hi: फिर से लिंक किया गया: {fileName}

# relinkSaveAndCloseTooltip
source: Save & Close
hi: सहेजें और बंद करें

# relinkNoMissingMedia
source: No missing or deleted media found.
hi: कोई गायब या हटाया गया मीडिया नहीं मिला।

# relinkScanFolderButton
source: Scan folder for missing files
hi: गायब फ़ाइलों के लिए फ़ोल्डर स्कैन करें

# relinkRescanTooltip
source: Rescan
hi: पुनः स्कैन करें

# exportShareMessage
source: Check out my video!
hi: मेरा वीडियो देखें!

# exportShareMore
source: More
hi: अधिक

# exportFullCancelButton
source: Cancel Export
hi: एक्सपोर्ट रद्द करें

# exportFullCloseButton
source: Close
hi: बंद करें

# exportFullDoNotLock
source: Please do not lock screen or switch to other apps
hi: कृपया स्क्रीन लॉक न करें या अन्य ऐप्स पर न जाएं

# playbackPreviewTitle
source: Preview
hi: पूर्वावलोकन

# shaderSubmenuEffectsTooltip
source: Effects
hi: प्रभाव (Effects)

# shaderSubmenuFiltersTooltip
source: Filters
hi: फ़िल्टर

# shaderTypeEffectLabel
source: Effect Type
hi: प्रभाव प्रकार

# shaderTypeFilterLabel
source: Filter Type
hi: फ़िल्टर प्रकार

# shaderParamIntensityShort
source: Intensity
hi: तीव्रता

# shaderParamSpeedShort
source: Speed
hi: गति

# shaderParamSizeShort
source: Size
hi: आकार

# shaderParamDensityShort
source: Density
hi: घनत्व

# shaderParamAngleShort
source: Angle
hi: कोण

# shaderParamFrequencyShort
source: Frequency
hi: आवृत्ति

# shaderParamAmplitudeShort
source: Amplitude
hi: आयाम

# shaderParamBlurShort
source: Blur
hi: धुंधलापन

# shaderParamVignetteShort
source: Vignette
hi: विनेट

# shaderParamIntensity
source: Intensity (Strength)
hi: तीव्रता (शक्ति)

# shaderParamSpeed
source: Speed (Rate)
hi: गति (दर)

# shaderParamSize
source: Size (Scale)
hi: आकार (स्केल)

# shaderParamDensity
source: Density (Amount)
hi: घनत्व (मात्रा)

# shaderParamAngle
source: Angle (Direction)
hi: कोण (दिशा)

# shaderParamFrequency
source: Frequency (Detail)
hi: आवृत्ति (विवरण)

# shaderParamAmplitude
source: Amplitude (Strength)
hi: आयाम (शक्ति)

# shaderParamBlurRadius
source: Blur Radius (Amount)
hi: धुंध त्रिज्या (मात्रा)

# shaderParamVignetteSize
source: Vignette Size
hi: विनेट आकार

# shaderParamColor
source: Color
hi: रंग

# shaderParamFractalSize
source: Complexity (Detail Level)
hi: जटिलता (विवरण स्तर)

# shaderParamFractalDensity
source: Scale (Zoom)
hi: स्केल (ज़ूम)

# shaderParamPsychedelicSize
source: Scale (Zoom)
hi: स्केल (ज़ूम)

# shaderParamPsychedelicDensity
source: Complexity (Detail Level)
hi: जटिलता (विवरण स्तर)

# textStyleSizeLabel
source: Size
hi: आकार

# textStyleAlphaLabel
source: Alpha
hi: अल्फा

# textStyleTextColor
source: Text
hi: टेक्स्ट

# textStyleBoxColor
source: Box
hi: बॉक्स

# textStyleOutlineSection
source: Outline
hi: रूपरेखा (Outline)

# textStyleOutlineWidth
source: Width
hi: चौड़ाई

# textStyleOutlineColor
source: Color
hi: रंग

# textStyleShadowGlowSection
source: Shadow & Glow
hi: छाया और चमक

# textStyleShadowBlur
source: Blur
hi: धुंधलापन

# textStyleShadowOffsetX
source: Offset X
hi: ऑफसेट X

# textStyleShadowOffsetY
source: Offset Y
hi: ऑफसेट Y

# textStyleGlowRadius
source: Glow Radius
hi: चमक त्रिज्या

# textStyleShadowColor
source: Shadow
hi: छाया

# textStyleGlowColor
source: Glow
hi: चमक

# textStyleBoxBackgroundSection
source: Box Background
hi: बॉक्स पृष्ठभूमि

# textStyleBoxBorderWidth
source: Border
hi: बॉर्डर

# textStyleBoxCornerRadius
source: Radius
hi: त्रिज्या

# textStylePreviewLabel
source: Preview
hi: पूर्वावलोकन

# textStyleSubmenuStyleTooltip
source: Style
hi: शैली

# textStyleSubmenuEffectsTooltip
source: Effects
hi: प्रभाव

# textStyleSubmenuAnimationTooltip
source: Animation
hi: एनीमेशन

# textStyleFontLabel
source: Font:
hi: फ़ॉन्ट:

# textStyleEnableBoxLabel
source: Enable Box:
hi: बॉक्स सक्षम करें:

# textEffectHeader
source: Effect:
hi: प्रभाव:

# textEffectPresetHeader
source: Preset:
hi: प्रीसेट:

# textEffectStrengthLabel
source: Strength
hi: शक्ति

# textEffectSpeedLabel
source: Speed
hi: गति

# textEffectAngleLabel
source: Angle
hi: कोण

# textEffectThicknessLabel
source: Thickness
hi: मोटाई

# textEffectPresetNeon
source: NEON
hi: नियॉन

# textEffectPresetRainbow
source: RAINBOW
hi: इंद्रधनुष

# textEffectPresetMetal
source: METAL
hi: मेटल

# textEffectPresetWave
source: WAVE
hi: वेव

# textEffectPresetGlitch
source: GLITCH
hi: ग्लिच

# textEffectNameGradient
source: GRADIENT
hi: ग्रेडिएंट

# textEffectNameWave
source: WAVE
hi: वेव

# textEffectNameGlitch
source: GLITCH
hi: ग्लिच

# textEffectNameNeon
source: NEON
hi: नियॉन

# textEffectNameMetal
source: METAL
hi: मेटल

# textEffectNameRainbow
source: RAINBOW
hi: इंद्रधनुष

# textEffectNameChrome
source: CHROME
hi: क्रोम

# textEffectNameScanlines
source: SCANLINES
hi: स्कैनलाइन्स

# textEffectNameRgbShift
source: RGB SHIFT
hi: RGB शिफ्ट

# textEffectNameDuotone
source: DUOTONE
hi: डुओटोन

# textEffectNameHolo
source: HOLO
hi: होलो

# textEffectNameNoiseFlow
source: NOISE FLOW
hi: नॉयज़ फ्लो

# textEffectNameSparkle
source: SPARKLE
hi: स्पार्कल

# textEffectNameLiquid
source: LIQUID
hi: लिक्विड

# textEffectNameInnerGlow
source: INNER GLOW
hi: इनर ग्लो

# textEffectNameInnerShadow
source: INNER SHADOW
hi: इनर शैडो

# textEffectNameNone
source: NONE
hi: कोई नहीं

# textAnimHeader
source: Animation:
hi: एनीमेशन:

# textAnimSpeedLabel
source: Speed
hi: गति

# textAnimAmplitudeLabel
source: Amplitude
hi: आयाम

# textAnimPhaseLabel
source: Phase
hi: चरण

# textAnimNameTypeDelete
source: TYPE/DELETE
hi: टाइप/डिलीट

# textAnimNameSlideLr
source: SLIDE L-R
hi: स्लाइड L-R

# textAnimNameSlideRl
source: SLIDE R-L
hi: स्लाइड R-L

# textAnimNameShakeH
source: SHAKE H
hi: शेक H

# textAnimNameShakeV
source: SHAKE V
hi: शेक V

# textAnimNameScanRl
source: SCAN R-L
hi: स्कैन R-L

# textAnimNameSweepLrRl
source: SWEEP LR-RL
hi: स्वीप LR-RL

# textAnimNameGlowPulse
source: GLOW PULSE
hi: ग्लो पल्स

# textAnimNameOutlinePulse
source: OUTLINE PULSE
hi: आउटलाइन पल्स

# textAnimNameShadowSwing
source: SHADOW SWING
hi: शैडो स्विंग

# textAnimNameFadeIn
source: FADE IN
hi: फेड इन

# textAnimNameZoomIn
source: ZOOM IN
hi: ज़ूम इन

# textAnimNameSlideUp
source: SLIDE UP
hi: स्लाइड अप

# textAnimNameBlurIn
source: BLUR IN
hi: ब्लर इन

# textAnimNameScramble
source: SCRAMBLE
hi: स्क्रैम्बल

# textAnimNameFlipX
source: FLIP X
hi: फ्लिप X

# textAnimNameFlipY
source: FLIP Y
hi: फ्लिप Y

# textAnimNamePopIn
source: POP IN
hi: पॉप इन

# textAnimNameRubberBand
source: RUBBER BAND
hi: रबर बैंड

# textAnimNameWobble
source: WOBBLE
hi: वोबल

# textPlayerHintEdit
source: Click to edit text
hi: टेक्स्ट संपादित करने के लिए क्लिक करें

# videoSettingsAspectRatioLabel
source: Aspect Ratio:
hi: आस्पेक्ट रेश्यो:

# videoSettingsCropModeLabel
source: Crop Mode:
hi: क्रॉप मोड:

# videoSettingsRotationLabel
source: Rotation:
hi: रोटेशन:

# videoSettingsFlipLabel
source: Flip:
hi: फ्लिप:

# videoSettingsBackgroundLabel
source: Background:
hi: पृष्ठभूमि:

# videoSettingsCropModeFit
source: Fit
hi: फिट

# videoSettingsCropModeFill
source: Fill
hi: भरें (Fill)
