Repository: kumarmantu511/vid_viz
Catalog: lib/l10n/app_*.arb
Languages: hi

# videoSettingsCropModeStretch
source: Stretch
hi: खिंचाव (Stretch)

# videoSettingsBackgroundBlack
source: Black
hi: काला

# videoSettingsBackgroundWhite
source: White
hi: सफ़ेद

# videoSettingsBackgroundGray
source: Gray
hi: धूसर

# videoSettingsBackgroundBlue
source: Blue
hi: नीला

# videoSettingsBackgroundGreen
source: Green
hi: हरा

# videoSettingsBackgroundRed
source: Red
hi: लाल

# videoSpeedTitle
source: Playback Speed
hi: प्लेबैक गति

# videoSpeedRippleLabel
source: Ripple (move following clips)
hi: रिपल (बाद वाली क्लिप्स को खिसकाएं)

# videoSpeedNote
source: Note: Preview plays audio with player speed. Export matches speed using FFmpeg atempo.
hi: नोट: पूर्वावलोकन प्लेयर गति के साथ ऑडियो चलाता है। एक्सपोर्ट FFmpeg atempo का उपयोग करके गति का मिलान करता है।

# videoSettingsFlipHorizontal
source: Horizontal
hi: क्षैतिज

# videoSettingsFlipVertical
source: Vertical
hi: लंबवत

# visualizerSubmenuCanvasTooltip
source: Canvas Effects
hi: कैनवास प्रभाव

# visualizerSubmenuProgressTooltip
source: Progress Bars
hi: प्रगति बार

# visualizerSubmenuShaderTooltip
source: Shader Effects
hi: शेडर प्रभाव

# visualizerSubmenuVisualTooltip
source: Visual Backgrounds
hi: दृश्य पृष्ठभूमि

# visualizerSubmenuSettingsTooltip
source: All Settings
hi: सभी सेटिंग्स

# visualizerAudioEmptyTimeline
source: No audio sources in timeline
hi: टाइमलाइन में कोई ऑडियो स्रोत नहीं

# visualizerAudioLabel
source: Audio:
hi: ऑडियो:

# visualizerAudioSelectHint
source: Select audio
hi: ऑडियो चुनें

# visualizerEffectLabel
source: Effect:
hi: प्रभाव:

# visualizerScaleLabel
source: Scale:
hi: स्केल:

# visualizerBarsLabel
source: Bars:
hi: बार्स:

# visualizerSpacingLabel
source: Spacing:
hi: अंतर:

# visualizerHeightLabel
source: Height:
hi: ऊंचाई:

# visualizerRotationLabel
source: Rotation:
hi: रोटेशन:

# visualizerThicknessLabel
source: Thickness:
hi: मोटाई:

# visualizerGlowLabel
source: Glow:
hi: चमक:

# visualizerMirrorLabel
source: Mirror:
hi: दर्पण:

# visualizerColorLabel
source: Color
hi: रंग

# textColorLabel
source: Color
hi: रंग

# visualizerGradientLabel
source: Gradient:
hi: ग्रेडिएंट:

# visualizerBackgroundLabel
source: Background:
hi: पृष्ठभूमि:

# visualizerIntensityLabel
source: Intensity:
hi: तीव्रता:

# visualizerSpeedLabel
source: Speed:
hi: गति:

# visualizerVisualLabel
source: Visual:
hi: दृश्य:

# visualizerTrackOpacityLabel
source: Track opacity:
hi: ट्रैक ओपेसिटी:

# visualizerLabelSizeLabel
source: Label size:
hi: लेबल आकार:

# visualizerLabelAnimLabel
source: Label animation:
hi: लेबल एनीमेशन:

# visualizerLabelPositionLabel
source: Label position:
hi: लेबल स्थिति:

# visualizerStyleLabel
source: Style:
hi: शैली:

# visualizerCornerLabel
source: Corner:
hi: कोना:

# visualizerGapLabel
source: Gap:
hi: गैप:

# visualizerHeadSizeLabel
source: Head size:
hi: हेड आकार:

# visualizerHeadAnimLabel
source: Head animation:
hi: हेड एनीमेशन:

# visualizerHeadEffectLabel
source: Head effect:
hi: हेड प्रभाव:

# visualizerPresetsLabel
source: Presets:
hi: प्रीसेट्स:

# visualizerTrackLabel
source: Track:
hi: ट्रैक:

# visualizerVisualFullscreenTooltip
source: Draw visualizer as full-screen overlay
hi: विज़ुअलाइज़र को फ़ुल-स्क्रीन ओवरले के रूप में ड्रा करें

# visualizerShaderFullscreenTooltip
source: Draw visualizer shader as full-screen background
hi: विज़ुअलाइज़र शेडर को फ़ुल-स्क्रीन बैकग्राउंड के रूप में ड्रा करें

# visualizerShaderLabel
source: Shader:
hi: शेडर:

# visualizerShaderOptionBars
source: Bars
hi: बार्स

# visualizerShaderOptionCircleBars
source: Circle Bars
hi: सर्कल बार्स

# visualizerShaderOptionCircle
source: Circle
hi: सर्कल

# visualizerShaderOptionNationCircle
source: Nation Circle
hi: नेशन सर्कल

# visualizerShaderOptionWaveform
source: Waveform
hi: वेवफॉर्म

# visualizerShaderOptionSmoothCurves
source: Smooth Curves
hi: स्मूथ कर्व्स

# visualizerShaderOptionClaudeSpectrum
source: Claude Spectrum
hi: क्लॉड स्पेक्ट्रम

# visualizerShaderOptionSinusWaves
source: Sinus Waves
hi: साइनस वेव्ज़

# visualizerShaderOptionOrb
source: Orb
hi: ओर्ब

# visualizerShaderOptionPyramid
source: Pyramid
hi: पिरामिड

# visualizerThemeLabel
source: Theme:
hi: थीम:

# visualizerProgressStyleCapsule
source: Capsule
hi: कैप्सूल

# visualizerProgressStyleSegments
source: Segments
hi: सेगमेंट

# visualizerProgressStyleSteps
source: Steps
hi: स्टेप्स

# visualizerProgressStyleCentered
source: Centered
hi: केंद्रित

# visualizerProgressStyleOutline
source: Outline
hi: रूपरेखा

# visualizerProgressStyleThin
source: Thin
hi: पतला

# visualizerHeadAnimNone
source: None
hi: कोई नहीं

# visualizerHeadAnimStatic
source: Static
hi: स्थिर

# visualizerHeadAnimPulse
source: Pulse
hi: पल्स

# visualizerHeadAnimSpark
source: Spark
hi: स्पार्क

# visualizerPresetClean
source: Clean
hi: क्लीन

# visualizerPresetNeonClub
source: Neon club
hi: नियॉन क्लब

# visualizerPresetCinematic
source: Cinematic
hi: सिनेमैटिक

# visualizerPresetGlitchy
source: Glitchy
hi: ग्लिची

# visualizerPresetFireBlast
source: Fire blast
hi: फायर ब्लास्ट

# visualizerPresetElectricBlue
source: Electric blue
hi: इलेक्ट्रिक ब्लू

# visualizerPresetRainbowRoad
source: Rainbow road
hi: रेनबो रोड

# visualizerPresetSoftPastel
source: Soft pastel
hi: सॉफ्ट पेस्टल

# visualizerPresetIceCold
source: Ice cold
hi: आइस कोल्ड

# visualizerPresetMatrixCode
source: Matrix code
hi: मैट्रिक्स कोड

# visualizerThemeClassic
source: Classic
hi: क्लासिक

# visualizerThemeFire
source: Fire
hi: फायर

# visualizerThemeElectric
source: Electric
hi: इलेक्ट्रिक

# visualizerThemeNeon
source: Neon
hi: नियॉन

# visualizerThemeRainbow
source: Rainbow
hi: रेनबो

# visualizerThemeGlitch
source: Glitch
hi: ग्लिच

# visualizerThemeSoft
source: Soft
hi: सॉफ्ट

# visualizerThemeSunset
source: Sunset
hi: सनसेट

# visualizerThemeIce
source: Ice
hi: आइस

# visualizerThemeMatrix
source: Matrix
hi: मैट्रिक्स

# visualizerLabelSizeSmall
source: Small
hi: छोटा

# visualizerLabelSizeNormal
source: Normal
hi: सामान्य

# visualizerLabelSizeLarge
source: Large
hi: बड़ा

# visualizerCounterAnimStatic
source: Static
hi: स्थिर

# visualizerCounterAnimPulse
source: Pulse
hi: पल्स

# visualizerCounterAnimFlip
source: Flip
hi: फ्लिप

# visualizerCounterAnimLeaf
source: Leaf
hi: लीफ

# visualizerCounterPositionCenter
source: Center
hi: केंद्र

# visualizerCounterPositionTop
source: Top
hi: शीर्ष

# visualizerCounterPositionBottom
source: Bottom
hi: नीचे

# visualizerCounterPositionSides
source: Sides
hi: किनारे

# visualizerOverlaySettingsTitle
source: Overlay Settings:
hi: ओवरले सेटिंग्स:

# visualizerOverlayCenterImageLabel
source: Center Image
hi: सेंटर इमेज

# visualizerOverlayRingColorLabel
source: Ring Color
hi: रिंग का रंग

# visualizerOverlayBackgroundLabel
source: Background
hi: पृष्ठभूमि

# visualizerNoAudioSource
source: No Audio Source
hi: कोई ऑडियो स्रोत नहीं

# mediaOverlaySubmenuTooltip
source: Media Overlay
hi: मीडिया ओवरले

# mediaOverlayAnimDurationLabel
source: Anim Duration
hi: एनीमेशन अवधि

# mediaOverlaySourceTitle
source: Source ({count} available)
hi: स्रोत ({count} उपलब्ध)

# mediaOverlayAddVideo
source: Add Video
hi: वीडियो जोड़ें

# mediaOverlayAddImage
source: Add Image
hi: छवि जोड़ें

# mediaOverlayPositionLabel
source: Position {axis}
hi: स्थिति {axis}

# mediaOverlayScaleLabel
source: Scale
hi: स्केल

# mediaOverlayOpacityLabel
source: Opacity
hi: ओपेसिटी

# mediaOverlayRotationLabel
source: Rotation
hi: रोटेशन

# mediaOverlayCornerLabel
source: Corner
hi: कोना

# mediaOverlayAnimationLabel
source: Animation:
hi: एनीमेशन:

# mediaOverlayAnimNone
source: None
hi: कोई नहीं

# mediaOverlayAnimFadeIn
source: Fade In
hi: फेड इन

# mediaOverlayAnimFadeOut
source: Fade Out
hi: फेड आउट

# mediaOverlayAnimSlideLeft
source: Slide ←
hi: स्लाइड ←

# mediaOverlayAnimSlideRight
source: Slide →
hi: स्लाइड →

# mediaOverlayAnimSlideUp
source: Slide ↑
hi: स्लाइड ↑

# mediaOverlayAnimSlideDown
source: Slide ↓
hi: स्लाइड ↓

# mediaOverlayAnimZoomIn
source: Zoom In
hi: ज़ूम इन

# mediaOverlayAnimZoomOut
source: Zoom Out
hi: ज़ूम आउट

# mediaPickerTitle
source: 📱 Pick media from device
hi: 📱 डिवाइस से मीडिया चुनें

# mediaPickerLoadedCount
source: {count} items loaded
hi: {count} आइटम लोड किए गए

# mediaPickerSearchHint
source: Search media...
hi: मीडिया खोजें...

# mediaPickerTabAll
source: All ({count})
hi: सभी ({count})

# mediaPickerTabImages
source: Images ({count})
hi: छवियां ({count})

# mediaPickerTabVideos
source: Videos ({count})
hi: वीडियो ({count})

# mediaPickerTabAudio
source: Audio ({count})
hi: ऑडियो ({count})

# mediaPickerSelectionLabel
source: media selected
hi: मीडिया चयनित

# mediaPickerClearSelection
source: Clear
hi: साफ़ करें

# mediaPickerLoading
source: Loading media...
hi: मीडिया लोड हो रहा है...

# mediaPickerEmpty
source: No media found
hi: कोई मीडिया नहीं मिला

# mediaPickerTypeVideo
source: Video
hi: वीडियो

# mediaPickerTypeImage
source: Image
hi: छवि

# mediaPickerTypeAudio
source: Audio
hi: ऑडियो

# mediaPickerAddToProject
source: Add to project ({count})
hi: प्रोजेक्ट में जोड़ें ({count})

# mediaPickerErrorGeneric
source: Error: {error}
hi: त्रुटि: {error}

# visualizerSettingsAdvancedTitle
source: Advanced Settings
hi: एडवांस्ड सेटिंग्स

# visualizerSettingsAdvancedSubtitle
source: FFT and audio processing parameters
hi: FFT और ऑडियो प्रोसेसिंग पैरामीटर

# visualizerSettingsApplyFftSnack
source: FFT recomputing with new parameters...
hi: नए मापदंडों के साथ FFT की पुनर्गणना हो रही है...

# visualizerSettingsApplyFftButton
source: Apply & Recompute FFT
hi: लागू करें और FFT पुनर्गणना करें

# visualizerSettingsStaticTitle
source: Static Parameters
hi: स्थिर पैरामीटर

# visualizerSettingsStaticFftSizeLabel
source: FFT Size
hi: FFT आकार

# visualizerSettingsStaticFftSizeTooltip
source: Window size for FFT computation (fixed)
hi: FFT गणना के लिए विंडो का आकार (निश्चित)

# visualizerSettingsStaticHopSizeLabel
source: Hop Size
hi: हॉप आकार

# visualizerSettingsStaticHopSizeTooltip
source: Step size between FFT windows (fixed)
hi: FFT विंडोज़ के बीच कदम का आकार (निश्चित)

# visualizerSettingsStaticSampleRateLabel
source: Sample Rate
hi: सैंपल रेट

# visualizerSettingsStaticSampleRateTooltip
source: Audio sampling rate (fixed)
hi: ऑडियो सैंपलिंग दर (निश्चित)

# visualizerSettingsCacheTitle
source: Cache Status
hi: कैश स्थिति

# visualizerSettingsClearCacheSnack
source: FFT cache cleared
hi: FFT कैश साफ़ कर दिया गया

# visualizerSettingsClearCacheButton
source: Clear FFT Cache
hi: FFT कैश साफ़ करें

# visualizerSettingsPerformanceTitle
source: Performance
hi: प्रदर्शन

# visualizerSettingsRenderPipelineLabel
source: Render Pipeline
hi: रेंडर पाइपलाइन

# visualizerSettingsRenderPipelineCanvas
source: Canvas (CPU)
hi: कैनवास (CPU)

# visualizerSettingsRenderPipelineShader
source: Shader (GPU)
hi: शेडर (GPU)

# visualizerSettingsRenderPipelineTooltip
source: Current rendering backend
hi: वर्तमान रेंडरिंग बैकएंड

# visualizerSettingsFftAboutTitle
source: ℹ️ About FFT Processing
hi: ℹ️ FFT प्रोसेसिंग के बारे में

# visualizerSettingsFftAboutBody
source: Audio is processed with 2048-point FFT, downsampled to 64 log-scale bands (50Hz-16kHz), normalized per-frame, and smoothed with EMA (α=0.6) for stable visualization.
hi: ऑडियो को 2048-बिंदु FFT के साथ प्रोसेस किया जाता है, 64 लॉग-स्केल बैंड (50Hz-16kHz) में डाउनसैंपल किया जाता है, प्रति-फ्रेम सामान्यीकृत किया जाता है, और स्थिर विज़ुअलाइज़ेशन के लिए EMA (α=0.6) के साथ स्मूथ किया जाता है।

# visualizerSettingsPresetsTitle
source: Presets
hi: प्रीसेट्स

# visualizerSettingsPresetsTooltip
source: Quick profiles for FFT bands, smoothing and dynamics.
hi: FFT बैंड, स्मूथिंग और डायनामिक्स के लिए त्वरित प्रोफाइल।

# visualizerSettingsPresetCinematic
source: Cinematic
hi: सिनेमैटिक

# visualizerSettingsPresetAggressive
source: Aggressive
hi: आक्रामक (Aggressive)

# visualizerSettingsPresetLofi
source: Lo-Fi
hi: लो-फाई (Lo-Fi)

# visualizerSettingsPresetBassHeavy
source: Bass Heavy
hi: बास हैवी

# visualizerSettingsPresetVocalFocus
source: Vocal Focus
hi: वोकल फोकस

# visualizerSettingsPresetAppliedSnack
source: Preset "{preset}" applied. Press "Apply & Recompute FFT" for full effect.
hi: प्रीसेट "{preset}" लागू किया गया। पूर्ण प्रभाव के लिए "लागू करें और FFT पुनर्गणना करें" दबाएं।

# visualizerSettingsReactivityLabel
source: Reactivity
hi: रिएक्टिविटी

# visualizerSettingsReactivityTooltip
source: Curve shaping (0.5-2.0). Higher = more aggressive response, lower = softer.
hi: वक्र आकार देना (0.5-2.0)। उच्च = अधिक आक्रामक प्रतिक्रिया, निम्न = नरम।

# visualizerSettingsCacheCachedTitle
source: FFT Data Cached
hi: FFT डेटा कैश किया गया

# visualizerSettingsCacheProcessingTitle
source: FFT Processing...
hi: FFT प्रोसेसिंग...

# visualizerSettingsCacheCachedSubtitle
source: Audio analysis complete and ready
hi: ऑडियो विश्लेषण पूर्ण और तैयार

# visualizerSettingsCacheProcessingSubtitle
source: Audio is being analyzed in background
hi: पृष्ठभूमि में ऑडियो का विश्लेषण किया जा रहा है

# visualizerSettingsFftBandsLabel
source: FFT Bands
hi: FFT बैंड्स

# visualizerSettingsFftBandsTooltip
source: Number of frequency bands (32/64/128). More bands = finer detail but slower processing.
hi: फ्रीक्वेंसी बैंड की संख्या (32/64/128)। अधिक बैंड = महीन विवरण लेकिन धीमी प्रोसेसिंग।

# visualizerSettingsFftBandsValue
source: {bands} bands
hi: {bands} बैंड

# visualizerSettingsSmoothingLabel
source: Smoothing (EMA α)
hi: स्मूथिंग (EMA α)

# visualizerSettingsSmoothingTooltip
source: Temporal smoothing coefficient (0.0-1.0). Higher = faster response, lower = smoother but delayed.
hi: टेम्पोरल स्मूथिंग गुणांक (0.0-1.0)। उच्च = तेज़ प्रतिक्रिया, निम्न = स्मूथ लेकिन विलंबित।

# visualizerSettingsFrequencyRangeLabel
source: Frequency Range
hi: फ्रीक्वेंसी रेंज

# visualizerSettingsFrequencyRangeTooltip
source: Analyzed frequency range in Hz. Adjust for bass-heavy (lower min) or treble-focused (higher min) content.
hi: Hz में विश्लेषण की गई फ्रीक्वेंसी रेंज। बास-भारी (कम न्यूनतम) या ट्रेबल-केंद्रित (उच्च न्यूनतम) सामग्री के लिए समायोजित करें।

# visualizerSettingsFrequencyMinLabel
source: Min: {hz} Hz
hi: न्यूनतम: {hz} Hz

# visualizerSettingsFrequencyMaxLabel
source: Max: {hz} Hz
hi: अधिकतम: {hz} Hz

# visualizerSettingsAnimSmoothnessLabel
source: Animation Smoothness
hi: एनीमेशन स्मूथनेस

# visualizerSettingsAnimSmoothnessTooltip
source: Band smoothing (0.0-1.0). Higher = less flicker, more blur between bands.
hi: बैंड स्मूथिंग (0.0-1.0)। उच्च = कम टिमटिमाना, बैंड के बीच अधिक धुंधलापन।
